#define _CRT_SECURE_NO_WARNINGS
#include "tools.h"

void enter_menu()
{
	printf("****************************************************************\n");
	printf("*                  欢迎使用思政知识学习测试系统                *\n");
	printf("**                 ￥·     1.登    录     ·￥               **\n");
	printf("**                 ￥·     2.注    册     ·￥               **\n");
	printf("**                 ￥·     0.退出系统     ·￥               **\n");
	printf("****************************************************************\n");
	printf("select:>");
}

void menu()//主菜单
{
	printf("*****************************************************************\n");
	printf("* ~|                        尊敬的开发者                     |~ *\n");
	printf("* ~|                欢迎回到思政知识学习测试系统             |~ *\n");
	printf(" *=============================================================*\n");
	printf("|*|***==                    1.试题库管理                 ==***|*|\n");
	printf("|*|***==           $        2.在线测试         $         ==***|*|\n");
	printf("|*|***==                    3.测试结果查看               ==***|*|\n");
	printf("|*|***==                    4.账户信息查看               ==***|*|\n");
	printf("|*|***==                    0.退出系统                   ==***|*|\n");
	printf("=================================================================\n");
	printf("*****************************************************************\n");
	printf("select:>");
}

void menu2()//试题库管理菜单
{
	printf("*===============================================================*\n");
	printf("||                   1.题库录入                                ||\n");
	printf("||                   2.题库更改                                ||\n");
	printf("||                   3.题库查看                                ||\n");
	printf("||                   4.删除试题                                ||\n");
	printf("||                   0.返回系统                                ||\n");
	printf("*===============================================================*\n");
	printf("select:>");
	
}

void menu3i()//录入
{
	printf("*===============================================================*\n");
	printf("||  *录入菜单                                                  ||\n");
	printf("||                   1.单选库                                  ||\n");
	printf("||                   2.多选库                                  ||\n");
	printf("||                   3.判断库                                  ||\n");
	printf("||                   0.返回系统                                ||\n");
	printf("*===============================================================*\n");
	printf("select:>");
	
}

void menu3ii()//更改
{
	printf("*===============================================================*\n");
	printf("||  *更改菜单                                                  ||\n");
	printf("||                   1.单选库                                  ||\n");
	printf("||                   2.多选库                                  ||\n");
	printf("||                   3.判断库                                  ||\n");
	printf("||                   0.返回系统                                ||\n");
	printf("*===============================================================*\n");
	printf("select:>");
	
}

void menu3iii()//查看
{
	printf("*===============================================================*\n");
	printf("||  *查看菜单                                                  ||\n");
	printf("||                   1.单选库                                  ||\n");
	printf("||                   2.多选库                                  ||\n");
	printf("||                   3.判断库                                  ||\n");
	printf("||                   0.返回系统                                ||\n");
	printf("*===============================================================*\n");
	printf("select:>");
	
}

void menu3iiii()//查看
{
	printf("*===============================================================*\n");
	printf("||  *删除菜单                                                  ||\n");
	printf("||                   1.单选库                                  ||\n");
	printf("||                   2.多选库                                  ||\n");
	printf("||                   3.判断库                                  ||\n");
	printf("||                   0.返回系统                                ||\n");
	printf("*===============================================================*\n");
	printf("select:>");
	
}

void exam_menu()
{
	printf("*考试须知：                                              *\n");
	printf("*	本次考试由“单选题”“多选题”“判断题”题库中每种题   *\n");
	printf("*库随机抽取五道题组卷而成，请在每道题的后方输入你的答案，*\n");
	printf("*回车确定答案。                                          *\n");
	printf("*注意，每道题仅限答一次，无法更改！                      *\n");
	printf("*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~\n");
	printf("|*|                1.开始考试                          |*|\n");
	printf("|*|                0.取消考试                          |*|\n");
	printf("*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~\n");
	printf("select>");
}


void Students_menu()
{
	printf("**============================================**\n");
	printf("**                1、在线测试                 **\n");
	printf("**                0、退    出                 **\n");
	printf("**============================================**\n");
	printf("select:>");
}